micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_cortex.h
  return (READ_REG(MPU->RLAR & MPU_RLAR_LIMIT_Msk));
}

/**
  * @brief  Configure a MPU region base address
  * @rmtoll MPU_RNR      REGION    LL_MPU_SetRegionBaseAddress\n
  *         MPU_RBAR     BASE      LL_MPU_SetRegionBaseAddress
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @param  BaseAddress Value of region base address
  * @note   Cortex-M55 supports 16 secure and 16 non secure regions.
  * @retval None
  */
__STATIC_INLINE void LL_MPU_SetRegionBaseAddress(uint32_t Region, uint32_t BaseAddress)
{
  /* Set Region number */
  WRITE_REG(MPU->RNR, Region);

  /* Set base address */
  MODIFY_REG(MPU->RBAR, MPU_RBAR_BASE_Msk, (BaseAddress & MPU_RBAR_BASE_Msk));
}

/**
  * @brief  Get a MPU region base address
  * @rmtoll MPU_RNR      REGION    LL_MPU_GetRegionBaseAddress\n
  *         MPU_RBAR     BASE      LL_MPU_GetRegionBaseAddress
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @retval MPU region base address
  */
__STATIC_INLINE uint32_t LL_MPU_GetRegionBaseAddress(uint32_t Region)
{
  /* Set Region number */
  WRITE_REG(MPU->RNR, Region);

  return (READ_REG(MPU->RBAR & MPU_RBAR_BASE_Msk));
}

/**
  * @brief  Configure a MPU region access attributes and enable a region
  * @rmtoll MPU_RNR      REGION    LL_MPU_SetRegionAccess\n
  *         MPU_RBAR     XN        LL_MPU_SetRegionAccess\n
  *         MPU_RBAR     AP        LL_MPU_SetRegionAccess\n
  *         MPU_RBAR     SH        LL_MPU_SetRegionAccess
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @param  Attributes This parameter can be a combination of the following values:
  *         @arg @ref LL_MPU_INSTRUCTION_ACCESS_ENABLE or @ref LL_MPU_INSTRUCTION_ACCESS_DISABLE
  *         @arg @ref LL_MPU_ACCESS_NOT_SHAREABLE or @ref LL_MPU_ACCESS_OUTER_SHAREABLE
  *              or @ref LL_MPU_ACCESS_INNER_SHAREABLE
  *         @arg @ref LL_MPU_REGION_PRIV_RW or @ref LL_MPU_REGION_ALL_RW or @ref LL_MPU_REGION_PRIV_RO
  *              or @ref LL_MPU_REGION_ALL_RO
  * @note   Cortex-M55 supports 16 secure and 16 non secure regions.
  * @retval None
  */
__STATIC_INLINE void LL_MPU_SetRegionAccess(uint32_t Region, uint32_t Attributes)
{
  /* Set Region number */
  WRITE_REG(MPU->RNR, Region);

  /* Set base address */
  MODIFY_REG(MPU->RBAR, MPU_ACCESS_MSK, (Attributes & MPU_ACCESS_MSK));
}

/**
  * @brief  Get a MPU region access attributes
  * @rmtoll MPU_RNR      REGION    LL_MPU_GetRegionAccess\n
  *         MPU_RBAR     XN        LL_MPU_GetRegionAccess\n
  *         MPU_RBAR     AP        LL_MPU_GetRegionAccess\n
  *         MPU_RBAR     SH        LL_MPU_GetRegionAccess
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @retval MPU region access attributes
  */
__STATIC_INLINE uint32_t LL_MPU_GetRegionAccess(uint32_t Region)
{
  /* Set Region number */
  WRITE_REG(MPU->RNR, Region);

  return (READ_REG(MPU->RBAR & (MPU_RBAR_XN_Msk | MPU_RBAR_AP_Msk | MPU_RBAR_SH_Msk)));
}

#ifdef MPU_NS
/**
  * @brief  Configure a non-secure MPU region limit address
  * @rmtoll MPU_RNR      REGION    LL_MPU_SetRegionLimitAddress_NS\n
  *         MPU_RLAR     LIMIT     LL_MPU_SetRegionLimitAddress_NS
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @param  LimitAddress Value of region limit address
  * @note   Cortex-M55 supports 16 secure and 16 non secure regions.
  * @retval None
  */
__STATIC_INLINE void LL_MPU_SetRegionLimitAddress_NS(uint32_t Region, uint32_t LimitAddress)
{
  /* Set Region number */
  WRITE_REG(MPU_NS->RNR, Region);

  /* Set limit address */
  MODIFY_REG(MPU_NS->RLAR, MPU_RLAR_LIMIT_Msk, (LimitAddress & MPU_RLAR_LIMIT_Msk));
}

/**
  * @brief  Get a non-secure MPU region limit address
  * @rmtoll MPU_RNR      REGION    LL_MPU_GetRegionLimitAddress_NS\n
  *         MPU_RLAR     LIMIT     LL_MPU_GetRegionLimitAddress_NS
  * @param  Region This parameter can be one of the following values:
  *         @arg @ref LL_MPU_REGION_NUMBER0
  *         @arg @ref LL_MPU_REGION_NUMBER1
  *         @arg @ref LL_MPU_REGION_NUMBER2
  *         @arg @ref LL_MPU_REGION_NUMBER3
  *         @arg @ref LL_MPU_REGION_NUMBER4
  *         @arg @ref LL_MPU_REGION_NUMBER5
  *         @arg @ref LL_MPU_REGION_NUMBER6
  *         @arg @ref LL_MPU_REGION_NUMBER7
  *         @arg @ref LL_MPU_REGION_NUMBER8
  *         @arg @ref LL_MPU_REGION_NUMBER9
  *         @arg @ref LL_MPU_REGION_NUMBER10
  *         @arg @ref LL_MPU_REGION_NUMBER11
  *         @arg @ref LL_MPU_REGION_NUMBER12
  *         @arg @ref LL_MPU_REGION_NUMBER13
  *         @arg @ref LL_MPU_REGION_NUMBER14
  *         @arg @ref LL_MPU_REGION_NUMBER15
  * @retval Non-secure MPU region limit address
  */
__STATIC_INLINE uint32_t LL_MPU_GetRegionLimitAddress_NS(uint32_t Region)
{
  /* Set Region number */
  WRITE_REG(MPU_NS->RNR, Region);

